{"id":"691ebc64-fbb1-4728-b9b4-5442b6d7d69c","updated_at":"2026-04-18T05:19:56.143Z","updated_by":"siem","created_at":"2026-04-18T05:19:20.965Z","created_by":"siem","name":"Registry Run Key Persistence","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"Detects potential persistence via modification of Windows Registry Run keys (MITRE ATT&CK T1547.001). Adversaries may add or alter values under HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run or HKLM\\Software\\Microsoft\\Windows\\CurrentVersion\\Run to ensure malicious executables run at system startup. This rule helps identify suspicious registry changes that could indicate persistence mechanisms. Analysts should validate the modified key, investigate the associated executable, and determine whether it is authorized software or malicious activity.","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://192.168.31.130:5601/app/security"},"author":[],"false_positives":[],"from":"now-6m","rule_id":"97cfa581-0f64-4304-b1c6-72d587c265b1","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"},"technique":[{"id":"T1547","name":"Boot or Logon Autostart Execution","reference":"https://attack.mitre.org/techniques/T1547/","subtechnique":[]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"event.code: 13 AND\n  registry.path: (*\\\\CurrentVersion\\\\Run\\\\* OR *\\\\CurrentVersion\\\\RunOnce\\\\*) AND\n  NOT process.name: (\"MsMpEng.exe\" OR \"svchost.exe\" OR \"OneDrive.exe\")","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
