{"id":"f9d568f5-4f75-4ded-8753-564643d5d760","updated_at":"2026-04-25T04:15:34.083Z","updated_by":"siem","created_at":"2026-04-25T04:02:16.342Z","created_by":"siem","name":"Network Service Discovery (Suricata)","tags":[],"interval":"5m","enabled":true,"revision":4,"description":"This rule detects potential Network Service Discovery (MITRE ATT&CK T1046) activity within the internal subnet 192.168.75.0/24. It leverages Suricata alerts categorized as scan to identify hosts performing active probing of network services. Such behavior is often associated with adversaries mapping available services and ports in preparation for lateral movement or exploitation. Triggering this rule indicates that a system in the monitored subnet may be conducting reconnaissance scans against other hosts, which could represent malicious discovery attempts or unauthorized network scanning.","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://192.168.31.130:5601/app/security"},"author":[],"false_positives":[],"from":"now-6m","rule_id":"e8aefbbb-3db9-4680-a706-862226d26ea4","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0007","name":"Discovery","reference":"https://attack.mitre.org/tactics/TA0007/"},"technique":[{"id":"T1046","name":"Network Service Discovery","reference":"https://attack.mitre.org/techniques/T1046/","subtechnique":[]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"event.module: \"suricata\" AND event.kind: \"alert\" AND rule.name: *SCAN*","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
