{"id":"f06537d8-aeb0-40e3-a7e5-3d2ac6f5b46a","updated_at":"2026-04-20T09:22:08.773Z","updated_by":"siem","created_at":"2026-04-20T09:21:01.154Z","created_by":"siem","name":"DLL Injection via CreateRemoteThread","tags":[],"interval":"5m","enabled":true,"revision":1,"description":"This rule detects potential DLL injection activity using the Windows utility mavinject.exe. Attackers can abuse mavinject with the /INJECTRUNNING flag to load a DLL into the memory space of another running process via CreateRemoteThread. The query looks for Event ID 1 (process creation) where the process name is mavinject.exe and the command line includes /INJECTRUNNING. This behavior is commonly associated with adversary simulation tools (e.g., Atomic Red Team) but may also indicate malicious injection attempts. Detection of this activity helps identify process injection techniques used to gain code execution within trusted processes.","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://192.168.31.130:5601/app/security"},"author":[],"false_positives":[],"from":"now-6m","rule_id":"0013e73c-7d6a-4878-aa59-a9d055528e5f","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0004","name":"Privilege Escalation","reference":"https://attack.mitre.org/tactics/TA0004/"},"technique":[{"id":"T1055","name":"Process Injection","reference":"https://attack.mitre.org/techniques/T1055/","subtechnique":[{"id":"T1055.001","name":"Dynamic-link Library Injection","reference":"https://attack.mitre.org/techniques/T1055/001/"}]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"event.code: \"1\" AND\nprocess.name: \"mavinject.exe\" AND\nprocess.command_line: *INJECTRUNNING* AND\n\nNOT process.parent.executable: (\n    \"C:\\\\Windows\\\\System32\\\\msiexec.exe\" OR\n    \"C:\\\\Windows\\\\System32\\\\AppVClient.exe\" OR\n    \"C:\\\\Program Files\\\\Microsoft Application Virtualization\\\\*\"\n)\n","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
