{"id":"ee95f9d2-fb81-48fa-b281-4000a4bfcbb1","updated_at":"2026-04-20T04:14:12.688Z","updated_by":"siem","created_at":"2026-04-20T04:14:01.621Z","created_by":"siem","name":"Suspicious Scheduled Task Creation","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"This rule detects suspicious creation of scheduled tasks using schtasks.exe with triggers such as onlogon, onstart, once, or daily. Adversaries often abuse scheduled tasks to establish persistence or execute malicious payloads automatically at system startup or user logon. The detection excludes legitimate parent processes (svchost.exe, taskhostw.exe) to reduce false positives.","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://192.168.31.130:5601/app/security"},"author":[],"false_positives":[],"from":"now-6m","rule_id":"ecc7ff67-6011-4518-b73b-49be37ad6038","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0002","name":"Execution","reference":"https://attack.mitre.org/tactics/TA0002/"},"technique":[{"id":"T1053","name":"Scheduled Task/Job","reference":"https://attack.mitre.org/techniques/T1053/","subtechnique":[{"id":"T1053.005","name":"Scheduled Task","reference":"https://attack.mitre.org/techniques/T1053/005/"}]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"process.name: \"schtasks.exe\" AND\n  process.command_line: (*onlogon* OR *onstart* OR *ONCE* OR *DAILY*) AND\n  NOT process.parent.name: (\"svchost.exe\" OR \"taskhostw.exe\")","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
