{"id":"629f9c28-0051-4b4a-87a9-a2faa5168924","updated_at":"2026-04-15T08:44:15.166Z","updated_by":"siem","created_at":"2026-04-08T06:01:26.071Z","created_by":"siem","name":"Encoded PowerShell Execution Detection","tags":[],"interval":"5m","enabled":true,"revision":5,"description":"Detects execution of PowerShell with the -EncodedCommand flag, which is commonly used to obfuscate script content and evade detection.","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://192.168.31.130:5601/app/security"},"author":[],"false_positives":[],"from":"now-6m","rule_id":"b54e39d0-fa3b-454e-9998-bfc6d0b018c0","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0002","name":"Execution","reference":"https://attack.mitre.org/tactics/TA0002/"},"technique":[{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059/","subtechnique":[{"id":"T1059.001","name":"PowerShell","reference":"https://attack.mitre.org/techniques/T1059/001/"}]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"logs-*","query":"process.name : (\"powershell.exe\" OR \"pwsh.exe\") AND (\n  process.command_line : *FromBase64String* OR\n  process.command_line : *IEX* OR\n  process.command_line : *Invoke-Expression* OR\n  process.command_line : *-e * OR \n  process.command_line : *-en * OR \n  process.command_line : *-enc * OR \n  process.command_line : *-encodedCommand *\n)","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
