{"id":"6c945229-6d26-4858-89cb-6e8bc3b6adf2","updated_at":"2026-04-25T10:38:26.324Z","updated_by":"siem","created_at":"2026-04-25T10:34:19.128Z","created_by":"siem","name":"Malicious HTTP User Agent (C2 Beaconing)","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"Detects suspicious HTTP traffic that may indicate command‑and‑control (C2) beaconing by matching uncommon or malicious user‑agent strings and Suricata alerts related to malware, trojans, or beacon activity (MITRE ATT&CK T1071.001).","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://192.168.31.130:5601/app/security"},"author":[],"false_positives":[],"from":"now-6m","rule_id":"866e8fbd-3aee-4144-900d-f9371cd42a2d","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0011","name":"Command and Control","reference":"https://attack.mitre.org/tactics/TA0011/"},"technique":[{"id":"T1071","name":"Application Layer Protocol","reference":"https://attack.mitre.org/techniques/T1071/","subtechnique":[{"id":"T1071.001","name":"Web Protocols","reference":"https://attack.mitre.org/techniques/T1071/001/"}]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"event.module: \"suricata\" AND\nevent.kind: \"alert\" AND\n(\n  (\n    network.protocol: \"http\" AND\n    user_agent.original: (\n      *HttpBrowser* OR \"*<|>*\" OR *Wget/1.9+cvs* OR\n      *Opera/8.81* OR \"*python-requests*\" OR \"*Go-http-client*\"\n    )\n  ) OR\n  rule.category: (\n    \"A Network Trojan was detected\" OR\n    \"Malware Command and Control Activity Detected\"\n  ) OR\n  rule.name: (*MALWARE* OR *Trojan* OR *CnC* OR *C2* OR *Beacon* OR *RAT* OR *Backdoor*)\n)","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
