{"id":"108e4d58-bcb7-4a58-9ea0-b856ac36ff52","updated_at":"2026-05-01T04:44:09.235Z","updated_by":"siem","created_at":"2026-05-01T04:44:07.289Z","created_by":"siem","name":"Suspicious Script-Based Outbound Network Connection","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"Detects outbound network connections initiated by scripting or command-line\nprocesses (PowerShell, cmd, wscript) to commonly abused ports.\n\nThis behavior may indicate command-and-control (C2) activity, script-based\ndownloaders, or post-exploitation techniques where attackers use native\nWindows tools to communicate with external infrastructure.\n\nThis rule complements network-based detections by providing process-level\nvisibility and attribution.","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://192.168.31.130:5601/app/security"},"author":[],"false_positives":[],"from":"now-6m","rule_id":"de4d8208-e501-4f36-b206-7868c9b7a39c","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0011","name":"Command and Control","reference":"https://attack.mitre.org/tactics/TA0011/"},"technique":[{"id":"T1071","name":"Application Layer Protocol","reference":"https://attack.mitre.org/techniques/T1071/","subtechnique":[{"id":"T1071.001","name":"Web Protocols","reference":"https://attack.mitre.org/techniques/T1071/001/"}]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"event.code: 3 AND\nprocess.name: (\"powershell.exe\" OR \"cmd.exe\" OR \"wscript.exe\") AND\nnetwork.direction: \"egress\" AND\ndestination.port: (8080 OR 4444 OR 8888 OR 1337)","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
